#include <stdio.h>
#define MAXV 5
#define MAXE 2

int graph[MAXV];
int graph2[MAXV][MAXE]; // Двумерен масив 100 по 100 елемента 


int main(void) {
  // Елементарен насочен граф, но имаме ограничение от само една връзка

  // 1 ---> 2 ---> 3 ---> 4

  graph[1] = 2;
  graph[2] = 3;
  graph[3] = 4;

  // Елементарен насочен граф, който използва масив в масив. 

  //        +-------------+
  //        |             V
  // 1 ---> 2 ---> 3 ---> 4
  // |             ^  
  // +-------------+

  graph2[1][0] = 2;
  graph2[1][1] = 3; 
  
  graph2[2][0] = 3;
  graph2[2][1] = 4;
  
  graph2[3][0] = 4;

}





 
