#include <stdio.h>
#define MAX 200

int rib[MAX][2]; // Двумерен масив 
int n;

int main(void) {
  // Елементарен насочен граф, който използва двумерен масив. 

  //        +-------------+   +---+
  //        |             V   |   |
  // 1 ---> 2 ---> 3 ---> 4   --5<+    6     7
  // |      ^      ^                         |
  // +-------------+                         |
  //        |                                |
  //        +--------------------------------+
  
  n = 6;
  
  // представяне на граф чрез списък от ребра
  //  от връх:       до връх:
  rib[0][0] = 1; rib[0][1] = 3;
  rib[1][0] = 1; rib[1][1] = 2;
  rib[2][0] = 2; rib[2][1] = 3;
  rib[3][0] = 2; rib[3][1] = 4;
  rib[4][0] = 3; rib[4][1] = 4;
  
  // Добавяме нов връх, който е свързан със самия себе си
  rib[5][0] = 5; rib[5][1] = 5;
  
  // Добаваме нов връх, който не свързан
  rib[6][0] = 6; rib[6][1] = 0; // служебна стойност, нула, не сочи никъде!
  
  rib[7][0] = 7; rib[7][1] = 2;
}

