#include <stdio.h>
#define MAX 200

int rib[MAX][3]; // Двумерен масив 
int n;

int main(void) {
  // Елементарен насочен граф, който използва двумерен масив. 
  
  /*
  Боян Михайлов: 
  1 сам 
  me says:2 -> 4 
  me says:3 -> 4 
  me says:4 -> 2 
  3 -> 2
  * 
  *                 +--------+  
  *                 +        V
  * 1       2<------3        4
  *         +                ^
  *         +-----------------
  *         ^                +
  *         ------------------
  * 
  */
  
  n = 5;
  
  // представяне на граф чрез списък от ребра
  //  от връх:       до връх:
  rib[0][0] = 1; rib[0][1] = 0; rib[0][2] = 5;
  rib[1][0] = 2; rib[1][1] = 4; rib[1][2] = 65;
  rib[2][0] = 3; rib[2][1] = 4; rib[2][2] = 35;
  rib[3][0] = 4; rib[3][1] = 2; rib[3][2] = 45;
  rib[4][0] = 3; rib[4][1] = 2; rib[4][2] = 100;
}

