#include <stdio.h>
#define MAX 200

int matrix[MAX][MAX]; // Двумерен масив 
int n;

void init(void) {
  int i,j;
  
  for (i = 0; i < n; i++) {
    for (j = 0; j < n; j++) {
      matrix[i][j] = 0;
    }
  } 
}

int main(void) {
  // Елементарен насочен граф, който използва двумерен масив. 

  //               +------------(81)----------+
  //               |                          V
  // 1 ---(34)---> 2 ---(45)---> 3---(55)---> 4       5        6
  // |                           ^            ^                V
  // +------------(37)-----------+            +-------(67)------
  //
  init();
  
  n = 6;
  
  matrix[1-1][2-1] = 34;
  matrix[1-1][3-1] = 37;
  matrix[2-1][3-1] = 45;
  matrix[3-1][4-1] = 55;
  matrix[2-1][4-1] = 81;
  matrix[6-1][4-1] = 67;
  // Проблем!!! Реално можем да представим само една дъга между два върха! Следователно трябва да модифицираме метода.
}

