using System;

class Graph {
  const int n = 6;
  static int[][] matrix = new int[n][] ; // създаваме масив, който е празен  
  
  static void Init() {
    int i,j;
  
    for (i = 0; i < n; i++) {
      for (j = 0; j < n; j++) {
        matrix[i][j] = 0;
      }
    } 
  }
    
  static void Main() {
    Init();
    
    // Елементарен насочен граф, който използва двумерен масив. 
    
    //               +------------(81)----------+
    //               |                          V
    // 1 ---(34)---> 2 ---(45)---> 3---(55)---> 4       5        6
    // |                           ^            ^                V
    // +------------(37)-----------+            +-------(67)------
    //
    matrix[1-1][2-1] =  34;
    matrix[2-1][1-1] = -34;
    
    matrix[1-1][3-1] =  37;
    matrix[3-1][1-1] = -37;
    
    matrix[2-1][3-1] =  45;
    matrix[3-1][2-1] = -45;
    
    matrix[3-1][4-1] =  55;
    matrix[4-1][3-1] = -55;
    
    matrix[2-1][4-1] =  81;
    matrix[4-1][2-1] = -81;
    
    matrix[6-1][4-1] =  67;
    matrix[4-1][6-1] =  67;
  }
}

